Practical 10: 
Configuring ASA Basic Settings and Firewall

Part 1:Configure Router 
1->(Execute command on all routers)
enable secret enpa55
2->(Execute command on all routers) 
line console 0
password conpa55
login
exit
3->(Execute command on all routers) 
ip domain-name ccnasecurity.com
username admin secret pa55
line vty 0 4
login local
exit
crypto key generate rsa 
4->
R1
router ospf 1
network 209.165.200.0 0.0.0.7 area 0
network 10.1.1.0 0.0.0.3 area 0  

R2
router ospf 1
network 10.1.1.0 0.0.0.3 area 0
network 10.2.2.0 0.0.0.3 area 0

R3
router ospf 1
network 172.16.3.0 0.0.0.255 area 0
network 10.2.2.0 0.0.0.3 area 0
5->Verify connectivity.
Send packets from :
PCC -> R1, R2, R3
(Successful)
Send packets from: 
PCC -> ASA, PC-B, DMZ server
(Unsuccessful)

Part 2:Explore the ASA
Press enter for password
ASA#en
1->ASA#show version
ASA#show file system
ASA#show flash

Part 3:Configure ASA Settings and Interface Security
1->ASA(config)#hostname CCNAS-ASA
domain-name ccnasecurity.com
enable password enpa55
clock set (set time in hr:min:sec date month year)
month=may not 03

CCNA-ASA(config)#int vlan 1
nameif inside
ip address 192.168.1.1 255.255.255.0 
security-level 100
exit
int vlan 2
nameif outside
ip address 209.165.200.226 255.255.255.248
security-level 0
exit
2->ASA#show int ip brief
3->ASA#show ip address
show switch vlan
4->Test connectivity to the ASA.
PCB -> ASA
Successful 
PCB -> R1
Unsuccessful

Part 4:Configure Routing,Address Translation and Inspection Policy
1->ASA#show route
conf t
route outside 0.0.0.0 0.0.0.0 209.165.200.225
exit
show route
2->Test connectivity.
ASA -> R1
Successful 
3->conf t
object network inside-net
subnet 192.168.1.0 255.255.255.0
nat (inside,outside) dynamic interface
end
4->ASA#show run
PCB -> R1 
Unsuccessful
ASA#show nat

Step 5: Modify the default MPF application inspection global service policy
conf t
class-map inspection_default
match default-inspection-traffic
exit
policy-map global_policy
class inspection_default
inspect icmp
exit
service-policy global_policy global

Step 6:
PCB -> R1 
Successful

Part 5:Configure DHCP,AAA and SSH
Step 1:
ASA(config)#dhcpd address 192.168.1.5-192.168.1.36 inside
dhcpd dns 209.165.201.2 interface inside
dhcpd enable inside
Step 2:
ASA(config)#username admin password adminpa55
aaa authentication ssh console LOCAL
ASA(config)#crypto key generate rsa modulus 1024 
:no
ASA(config)#ssh 192.168.1.0 255.255.255.0 inside
ssh 172.16.3.3 255.255.255.255 outside
ssh timeout 10

PCC> ssh -l admin 209.165.200.226

PCB> ssh -l admin 192.168.1.1

Part 6:Configure a DMZ, Static NAT, and ACLs
Step 1:ASA(config)#
int vlan 3
ip address 192.168.2.1 255.255.255.0 
no forward interface vlan 1  
nameif dmz
security-level 70
int et0/2
switchport access vlan 3
exit
exit
Step 2:
#show int ip brief
#show ip address
#show switch vlan

Step 3:
ASA(config)#object network dmz-server
host 192.168.2.3 
nat (dmz,outside) static 209.165.200.227 
exit
Step 4:config#
access-list OUTSIDE-DMZ permit icmp any host 192.168.2.3
access-list OUTSIDE-DMZ permit tcp any host 192.168.2.3 eq 80
access-group OUTSIDE-DMZ in interface outside
Step 5:
Test access to the DMZ server.
The ability to successfully test outside access to the DMZ web server was not
in place; therefore, successful testing is not required
